{
  "project_name": "a1_t2",
  "paper_title": "# Azure’s Generative AI and Foundation Model Services",
  "language": "Spanish",
  "agents": [
    {
      "role": "Research Coordinator",
      "goal": "Facilitate productive discussion about the paper's content",
      "backstory": "You are an experienced research coordinator who ensures discussions \n            stay focused on the paper's content. You help organize thoughts and ensure all \n            important points from the paper are covered. You ONLY discuss what's in the paper."
    },
    {
      "role": "Methodology Explainer",
      "goal": "Explain the research methodology and approach as described in the paper",
      "backstory": "You are skilled at understanding and explaining research methodologies. \n                You help audiences understand how the research was conducted, what methods were used, \n                and why. You ONLY explain methods actually described in the paper."
    },
    {
      "role": "Technical Content Specialist",
      "goal": "Present technical content with clarity, minimal transitions, and zero interpretation",
      "backstory": "You are a precision-focused technical writer who excels at presenting information \n        accurately while maintaining readability through minimal, factual connections.\n        \n        Your approach is:\n        - DIRECT: Present facts, concepts, and ideas exactly as stated\n        - CLEAR: Use simple, unambiguous language\n        - ACCURATE: Never infer or extrapolate beyond the source material\n        - STRUCTURED: Organize information logically with minimal transitions\n        - CONNECTED: Use simple, factual transitions only (\"Additionally\", \"Furthermore\", \"Next\")\n        \n        You NEVER:\n        - Add interpretive language like \"This suggests...\" or \"This implies...\"\n        - Draw conclusions not explicitly stated in the source\n        - Use subjective language or personal opinions\n        - Add emotional color or narrative flourishes\n        - Infer implications or hidden meanings\n        - Use interpretive adjectives like \"revolutionary\", \"groundbreaking\", \"brilliant\"\n        - Add evaluative connections like \"Interestingly\" or \"Surprisingly\"\n        \n        You ALWAYS:\n        - State facts directly: \"X is Y\" not \"The author argues X is Y\"\n        - Present concepts clearly without interpretation\n        - Use technical terminology accurately\n        - Maintain objectivity and neutrality\n        - Add minimal factual transitions: \"The system includes...\", \"Components consist of...\", \"The process involves...\"\n        - Use simple connectors: \"Additionally\", \"Furthermore\", \"Subsequently\", \"Next\"\n        \n        ACCEPTABLE TRANSITIONS (factual only):\n        - \"The system includes three components.\"\n        - \"Additionally, the algorithm processes data in parallel.\"\n        - \"The method consists of four steps.\"\n        - \"Furthermore, the framework supports multiple protocols.\"\n        - \"Next, the process validates inputs.\"\n        - \"The architecture contains five layers.\"\n        \n        Your writing maintains technical accuracy while using minimal connections for readability."
    },
    {
      "role": "Technical Analyst",
      "goal": "Extract and present technical specifications, methods, and data with zero interpretation",
      "backstory": "You are a technical documentation specialist who presents information\n        exactly as stated. You extract specifications, algorithms, formulas, and technical\n        details without adding any interpretation or implications. Your analysis is purely\n        factual and objective. You NEVER use words like 'suggests', 'implies', or 'demonstrates'."
    },
    {
      "role": "Concept Definer",
      "goal": "Identify and define all technical concepts and terminology precisely as stated",
      "backstory": "You specialize in creating clear, accurate definitions of technical\n        concepts. You never add interpretation - you only state what each concept is\n        according to the source material. You organize concepts hierarchically and\n        show relationships without inferring unstated connections."
    },
    {
      "role": "Method Documentor",
      "goal": "Document methods, processes, and procedures exactly as described",
      "backstory": "You document technical methods and procedures with precision.\n        You list steps, parameters, and specifications without adding commentary\n        or evaluation. You present processes in clear, structured formats.\n        You ONLY state what the paper explicitly describes."
    }
  ],
  "tasks": [
    {
      "description": "\n            Analyze the synthesis of the paper titled \"# Azure’s Generative AI and Foundation Model Services\" and provide your perspective.\n            \n            Paper synthesis:\n            TLDR:\n• Azure offers a comprehensive suite of generative AI and foundation model services that empower developers to build and deploy AI-powered applications with enterprise-grade security and scalability.\n• Key services include Azure OpenAI Service for accessing models like GPT-4 and DALL·E 2, Azure Machine Learning for custom model training and orchestration (including Prompt Flow and MLOps), Azure Cognitive Search for vector and hybrid search, Azure AI Content Safety for moderation, and Azure AI Agent Service for building AI agents.\n• Together, these services simplify the creation of innovative, responsible, and production-ready AI applications built on a unified cloud infrastructure.\n\n-----------------------------------\nOrganized Content by Theme:\n\n1. Overview and Introduction\n-------------------------------------------------\n# Azure s Generative AI and Foundation Model Services\nMicrosoft Azure offers a comprehensive suite of services for building AI-powered applications with large language models (LLMs), generative AI, and other foundation models. These services provide everything from ready-to-use model APIs to tools for custom model training, vector-based search, content moderation, and orchestration. Below is an overview of the key Azure services in this domain and what they do, followed by ideas for what a developer might build on top of them.\n\n2. Key Azure AI Services and Their Capabilities\n-------------------------------------------------\n\nA. Azure OpenAI Service\n   • What it is:\n     - Azure OpenAI Service provides access to OpenAI's powerful generative models (like GPT-3.5, GPT-4, Codex, and DALL·E 2) via the Azure platform. It essentially delivers OpenAI’s models with Azure’s enterprise-grade security, compliance, and reliability, hosting them on its cloud.\n   • What it does:\n     - Enables a wide range of natural language and generative tasks: text generation, summarization, conversing with ChatGPT-style interfaces, code generation, and image creation from text prompts.\n     - Provides enterprise-focused features: Data sent through the API remains private and is not used to train the models. It also includes options like private networking, access control, and monitoring.\n     - Demonstrates production-scale capabilities as Microsoft utilizes this service internally for features such as GitHub Copilot and Office 365 Copilot.\n     - Source References: \n       • https://azure.microsoft.com/en-us/blog/general-availability-of-azure-openai-service-expands-access-to-large-advanced-ai-models-with-added-enterprise-benefits/\n       • https://learn.microsoft.com/en-us/azure/ai-foundry/responsible-ai/openai/data-privacy\n\nB. Azure Machine Learning (Azure ML)\n   • What it is:\n     - An enterprise-grade platform for developing, training, and deploying machine learning models at scale.\n     - Acts as the hub for custom AI development and supports not only traditional ML but also the complete lifecycle of generative AI apps.\n   • What it does:\n     - Facilitates bringing in models from multiple sources (Microsoft, OpenAI, Hugging Face, Meta, Cohere, etc.) and use them in various projects.\n     - Offers a large Model Catalog with thousands of models, including those from Hugging Face, such as Meta’s LLaMA-2 or other Transformer models.\n     - Simplifies model deployment, fine-tuning, and serving as API endpoints, thanks to managed GPU infrastructure and enterprise features like security, autoscaling, and monitoring.\n   • Special Tools (Prompt Flow and MLOps):\n     - Provides a visual and code-friendly interface (Prompt Flow) for designing, testing, and orchestrating prompt workflows, including chaining prompts, experimenting with variations, and evaluating outputs.\n     - Integrates orchestration libraries like LangChain and Semantic Kernel to support advanced prompt engineering and testing.\n     - Includes responsible AI and MLOps features for monitoring model usage, tracking response safety and quality, and setting up alerts for model drift.\n     - Source References:\n       • https://azure.microsoft.com/en-us/products/machine-learning/generative-ai\n       • https://techcommunity.microsoft.com/t5/ai-machine-learning-blog/generative-ai-in-azure-machine-learning-operationalizing-app/ba-p/3924524\n\nC. Azure Cognitive Search (Vector Search)\n   • What it is:\n     - A fully managed search-as-a-service that supports both traditional keyword search and modern vector similarity search, including hybrid search functionality.\n   • What it does:\n     - Turns enterprise data (documents, records, files) into an index that can be searched by AI systems.\n     - Plays a critical role in Retrieval-Augmented Generation (RAG) scenarios where vector search is used to retrieve semantically relevant text chunks that provide factual grounding for generative models.\n     - Includes ranking, filtering, and security features, ensuring users see only the permitted data.\n     - Used internally by Microsoft, for example in Office 365 Copilot where queries are processed using both document retrieval and AI summarization.\n     - Source References:\n       • https://azure.microsoft.com/en-us/products/ai-services/ai-search/\n\nD. Azure AI Content Safety\n   • What it is:\n     - A service and set of APIs designed to monitor content safety by detecting and filtering harmful or unwanted content across text and images.\n   • What it does:\n     - Analyzes text and images to assign severity scores for various categories such as hate speech, violence, sexual content, and self-harm.\n     - Flags issues like harassment, profanity, extremist language in text, and adult content or gore in images.\n     - Can be utilized as a pre- or post-processing step in AI workflows, for example integrated directly with Azure OpenAI Service or included in Prompt Flow chains.\n     - Ensures generative AI apps maintain compliance with content policies and responsible AI practices without the need for developers to train moderation models.\n     - Source References:\n       • https://www.microsoft.com/en-us/startups/blog/microsoft-azure-updates-every-startup-building-with-generative-ai-should-know-about/\n\nE. Azure AI Agent Service\n   • What it is:\n     - A newer offering (currently in preview) that assists developers in building AI agents – applications where an AI model can autonomously take actions or connect to external tools and data.\n   • What it does:\n     - Enables defining tools (e.g., API calls, database queries, web searches, custom functions) that an AI model can invoke.\n     - Provides an agent runtime to orchestrate communications between models and these tools.\n     - Supports building interactive and autonomous systems, such as chatbots or digital assistants that not only answer questions but also perform actions like scheduling meetings or creating support tickets.\n     - Leverages frameworks like LangChain or Semantic Kernel in a managed way, with added logging, monitoring, and security controls.\n     - Source References:\n       • https://learn.microsoft.com/en-us/azure/ai-services/what-are-ai-services\n\n3. Additional Azure AI Services and Features\n-------------------------------------------------\n\nA. Azure AI Speech:\n   • Offers services for speech-to-text, text-to-speech, and translation.\n   • Integrates OpenAI’s Whisper model for accurate, multilingual transcription.\n   • Supports applications like voice assistants and audio-based generative AI outputs.\n   • Source References:\n     • https://azure.microsoft.com/en-us/blog/whats-new-in-data-ai-expanding-choices-for-generative-ai-app-builders/\n\nB. Vision and Document AI:\n   • Provides image analysis, OCR, and document processing capabilities (via Azure AI Vision and Azure Form Recognizer / Document Intelligence).\n   • Incorporates both traditional ML and foundational computer vision models, including models deployable from Hugging Face.\n   • Enables use cases like image classification, object detection, segmentation, and more.\n   • Source References:\n     • https://azure.microsoft.com/en-us/blog/whats-new-in-data-ai-expanding-choices-for-generative-ai-app-builders/\n\nC. Azure AI Studio (Foundry):\n   • A unified web portal that brings together various Azure AI services.\n   • Allows developers to explore models, test prompt engineering, configure content safety, and chain services like Agent Service in one interface.\n   • Acts as a cohesive developer experience integrating the diverse Azure AI offerings.\n\n4. Opportunities to Build on Top of Azure’s AI Services\n-------------------------------------------------\nWith the array of Azure AI platforms available, developers have vast opportunities to create new, specialized solutions. Utilizing these services as foundational building blocks, applications can be developed that:\n   • Extend the capabilities of existing platforms with custom integrations or new features.\n   • Leverage enterprise-level security and compliance when deploying generative AI solutions.\n   • Innovate in areas such as conversational agents, automated data retrieval systems, content moderation workflows, voice assistants, and beyond.\n   • Address specific business needs and challenges that are not fully met by the provided base services, thereby adding extra value on top of Azure’s robust ecosystem.\n\n-----------------------------------\nAll sections organized above preserve the complete extracted content without further compression or synthesis, logically grouping the themes and topics as presented in the introduction section.\n            \n            CRITICAL: ONLY CONVERSATION AGENTS participate in this analysis:\n            - Base agents (Coordinator, Scientific Reviewer, Critical Thinker)\n            - Specialized domain agents\n            \n            EXCLUDED FROM ANALYSIS: Master Educational Science Communicator & Storyteller and Comedy Communicator (work in post-production)\n            \n            Each participating agent should:\n            1. Read and understand the paper from your specific role's perspective\n            2. Identify key points relevant to your expertise\n            3. Prepare questions or concerns to discuss\n            4. Consider the implications from your unique viewpoint\n            \n            SPECIALIZED AGENTS: Pay special attention to domain-specific aspects that only you can address.\n            \n            This should be a comprehensive TECHNICAL analysis where EVERY conversation agent contributes their specialized perspective.\n            \n            Language: Spanish\n            ",
      "expected_output": "Comprehensive technical analysis from conversation agents only (no post-production agents)",
      "agent_role": "Research Coordinator"
    },
    {
      "description": "\n                    SPECIALIZED AGENTS DEEP DIVE: Domain expertise from TECHNICAL conversation agents only.\n                    \n                    PARTICIPATING SPECIALIZED AGENTS (technical focus):\n                    - Method Documentor: Document methods, processes, and procedures exactly as described\n                    \n                    EXCLUDED: Comedy Communicator (works in post-production phase)\n                    \n                    Each specialized agent should:\n                    1. Provide deep domain-specific insights about the paper\n                    2. Identify methodological issues specific to your field\n                    3. Highlight implications that only someone with your expertise would notice\n                    4. Suggest domain-specific improvements or alternative approaches\n                    5. Connect this work to other research in your specialized area\n                    \n                    This is YOUR moment to shine with specialized knowledge that the base agents cannot provide.\n                    Focus on TECHNICAL DEPTH and DOMAIN EXPERTISE.\n                    Format as a detailed specialist consultation with clear attribution to each expert.\n                    \n                    Language: Spanish\n                    ",
      "expected_output": "Deep technical specialist analysis from 1 domain experts",
      "agent_role": "Method Documentor"
    },
    {
      "description": "\n            Based on the initial analysis, conduct a DYNAMIC Q&A session where technical conversation agents ask each other specific questions about the paper synthesis.\n            \n            PARTICIPATING AGENTS (technical conversation only):\n            - Base conversation agents (Coordinator, Scientific Reviewer, Critical Thinker) \n            - ALL specialized domain agents\n            \n            EXCLUDED FROM CONVERSATION: Master Educational Science Communicator & Storyteller and Comedy Communicator (work in post-production)\n            \n            Instructions for multi-agent technical conversation:\n            1. ALL TECHNICAL CONVERSATION AGENTS should ask pointed questions to other agents\n            2. SPECIALIZED AGENTS should ask domain-specific questions that challenge assumptions\n            3. BASE AGENTS should ask specialists to clarify complex domain concepts\n            4. Agents must respond to questions directed at them with detailed technical answers\n            5. Follow-up questions and clarifications are encouraged\n            6. Challenge each other's assumptions respectfully\n            7. Build on each other's ideas and insights\n            8. Create a natural back-and-forth technical dialogue\n            \n            SPECIALIZED AGENTS: This is crucial - ask questions only YOU would think to ask!\n            \n            Focus areas for technical questions:\n            - Domain-specific methodological concerns\n            - Interdisciplinary connections and conflicts\n            - Alternative interpretations from different expert perspectives\n            - Practical applications in each specialist's field\n            - Potential limitations or biases from multiple viewpoints\n            \n            Format this as a realistic TECHNICAL conversation with clear speaker identification for ALL conversation participants.\n            Keep the tone SERIOUS and TECHNICAL - humor will be added later in post-production.\n            \n            Language: Spanish\n            ",
      "expected_output": "Dynamic technical Q&A conversation between conversation agents only (no post-production or humor)",
      "agent_role": "Technical Content Specialist"
    },
    {
      "description": "\n            Organize a structured technical debate where conversation agents with different viewpoints engage in deeper discussion.\n            \n            PARTICIPATING AGENTS (technical conversation only):\n            - Base conversation agents (Coordinator, Scientific Reviewer, Critical Thinker)\n            - ALL specialized domain agents  \n            \n            EXCLUDED FROM DEBATE: Master Educational Science Communicator & Storyteller and Comedy Communicator (work in post-production)\n            \n            Technical debate structure:\n            1. Present the main controversial points or interpretations from the paper\n            2. Have TECHNICAL CONVERSATION AGENTS take different positions and argue their cases\n            3. SPECIALIZED AGENTS: Argue from your domain expertise - what would your field say?\n            4. Allow for rebuttals and counter-arguments between different expert perspectives\n            5. Explore edge cases and hypothetical scenarios from multiple disciplinary angles\n            6. Find areas of agreement and persistent disagreements between different specialties\n            7. Synthesize different viewpoints into a richer technical understanding\n            \n            This should feel like a real interdisciplinary TECHNICAL conference where:\n            - Different specialists bring unique perspectives that sometimes conflict\n            - Domain experts interrupt each other (politely) to make field-specific points\n            - Ideas evolve through interaction between different areas of expertise\n            - New insights emerge from cross-disciplinary exchange\n            - There's intellectual tension between different specialist viewpoints\n            \n            SPECIALIZED AGENTS: Don't hold back - defend your field's perspective!\n            \n            Make it conversational and dynamic, but keep TECHNICAL FOCUS - humor will be added later.\n            \n            Language: Spanish\n            ",
      "expected_output": "Rich interdisciplinary technical debate between conversation agents only (no post-production or humor)",
      "agent_role": "Methodology Explainer"
    },
    {
      "description": "\n            Conduct a collaborative synthesis where technical conversation agents work together to build a comprehensive understanding.\n            \n            PARTICIPATING AGENTS (technical conversation only):\n            - Base conversation agents (Coordinator, Scientific Reviewer, Critical Thinker)\n            - ALL specialized domain agents\n            \n            EXCLUDED FROM SYNTHESIS: Master Educational Science Communicator & Storyteller and Comedy Communicator (work in post-production)\n            \n            Technical collaborative process:\n            1. ALL TECHNICAL CONVERSATION AGENTS contribute their key insights from the discussions\n            2. SPECIALIZED AGENTS highlight unique perspectives only your field can provide\n            3. Agents build on each other's contributions in real-time\n            4. Identify connections between different specialist perspectives\n            5. Resolve conflicting interpretations through interdisciplinary dialogue\n            6. Co-create new insights that emerge from cross-domain discussion\n            7. Establish consensus on the most important takeaways from ALL conversation perspectives\n            \n            This should be a generative TECHNICAL conversation where:\n            - Ideas from one specialist spark new ideas in other specialists\n            - The group intelligence exceeds individual specialist perspectives\n            - Agents actively listen and respond to insights from other domains\n            - The conversation flows naturally between different areas of expertise\n            - New understanding emerges from interdisciplinary interaction\n            - Each specialist's unique knowledge contributes to the whole\n            \n            SPECIALIZED AGENTS: Share insights that ONLY someone with your expertise would have!\n            \n            Format as natural TECHNICAL conversation with organic transitions between specialist viewpoints.\n            Keep SERIOUS and FOCUSED - entertainment will be added later in post-production.\n            \n            Language: Spanish\n            ",
      "expected_output": "Collaborative technical synthesis conversation from conversation agents only (no post-production or humor)",
      "agent_role": "Research Coordinator"
    },
    {
      "description": "\n            Based on all previous conversations and analyses, conduct a final comprehensive technical discussion that synthesizes insights from conversation agents.\n            \n            PARTICIPATING AGENTS (technical conversation only):\n            - Base conversation agents (Coordinator, Scientific Reviewer, Critical Thinker)\n            - ALL specialized domain agents\n            \n            EXCLUDED: Master Educational Science Communicator & Storyteller and Comedy Communicator (they will process this output in post-production)\n            \n            The final technical discussion should:\n            1. Synthesize insights from the Q&A, specialist deep dive, debate, and collaborative sessions\n            2. Cover all major points of the paper from multiple expert perspectives\n            3. Include the rich specialist perspectives developed through agent interactions\n            4. Address concerns and criticisms that emerged from different domains\n            5. Explore implications and applications discussed by various specialists\n            6. Be comprehensive and technically rigorous for expert audiences\n            7. Highlight unique insights that could ONLY come from having multiple specialist perspectives\n            \n            CRITICAL: This final technical discussion must incorporate:\n            - Domain-specific insights from ALL specialist conversation agents\n            - Cross-disciplinary connections discovered during discussions\n            - Unique perspectives that emerged from interdisciplinary dialogue\n            - Technical depth and rigor appropriate for expert audiences\n            \n            This is the FINAL technical conversation output that will be handed to the post-production team.\n            Make it comprehensive, rigorous, and rich with all the insights gathered.\n            Keep it TECHNICAL and SERIOUS - post-production will handle accessibility and entertainment.\n            \n            Language: Spanish\n            ",
      "expected_output": "Final comprehensive technical discussion ready for post-production processing",
      "agent_role": "Technical Content Specialist"
    },
    {
      "description": "\n            Transform the previous task outputs into a technical presentation with ZERO interpretation.\n            \n            DOCUMENT TITLE: # Azure’s Generative AI and Foundation Model Services\n            \n            You must review ALL previous outputs and create a technical document that:\n            1. Presents ONLY factual information\n            2. Removes ALL interpretive language (revolutionary, groundbreaking, etc.)\n            3. States findings directly without implications\n            4. Uses technical manual style - clear and objective\n            5. Never adds \"this suggests\", \"this implies\", etc.\n            \n            \nCreate a technical presentation of the following content titled \"# Azure’s Generative AI and Foundation Model Services\".\n\nCONTENT TO PRESENT:\nUse the complete discussion from all previous tasks\n\nYOUR MISSION: Present this content with absolute clarity and zero interpretation.\n\nCRITICAL REQUIREMENTS:\n\n1. **DIRECT PRESENTATION ONLY**:\n   - State facts exactly as they appear\n   - Present concepts without interpretation\n   - List ideas without adding implications\n   - NO \"This suggests...\", \"This implies...\", \"This demonstrates...\"\n   - NO reflections or commentary\n\n2. **STRUCTURE**:\n   - Use clear headings and subheadings\n   - Present information in logical order\n   - Use bullet points for lists\n   - Number sequences or steps\n   - Group related concepts together\n\n3. **LANGUAGE RULES**:\n   - Use simple, technical language\n   - Define technical terms when first used\n   - Avoid adjectives that add interpretation\n   - No emotional or subjective language\n   - Be concise and precise\n   - Add minimal factual transitions for flow: \"Additionally\", \"Furthermore\", \"The system also\"\n   - Use simple structural connectors: \"consists of\", \"includes\", \"contains\"\n\n4. **CONTENT FIDELITY**:\n   - ONLY include factual information\n   - STRIP OUT all interpretive language from source\n   - Remove adjectives like \"revolutionary\", \"brilliant\", \"remarkable\"\n   - Convert subjective statements to objective facts\n   - NEVER add examples not in the source\n   - NEVER draw conclusions not stated\n   - NEVER add context or background\n   - NEVER interpret or analyze\n\n5. **FORMATTING**:\n   - Use markdown for structure\n   - Clear hierarchy with headers\n   - Bullet points for lists\n   - Code blocks for technical content\n   - Tables where appropriate\n\nEXAMPLES OF WHAT TO AVOID:\n❌ \"This revolutionary approach transforms how we think about...\"\n❌ \"The implications of this finding are profound...\"\n❌ \"This suggests a new paradigm in...\"\n❌ \"Interestingly, the authors reveal...\"\n❌ \"This demonstrates the power of...\"\n❌ \"This groundbreaking research...\"\n❌ \"The brilliant approach...\"\n❌ \"Remarkable findings...\"\n\nREMOVE INTERPRETIVE WORDS:\n- Revolutionary → [remove or say \"new\"]\n- Groundbreaking → [remove or say \"recent\"]\n- Brilliant/Remarkable → [remove completely]\n- Paradigm shift → \"change\" or remove\n- Transforms → \"changes\" or state the change directly\n\nEXAMPLES OF CORRECT STYLE:\n✅ \"The approach uses three components: A, B, and C.\"\n✅ \"The study found X increased by 47%. Additionally, processing time decreased by 30%.\"\n✅ \"The algorithm consists of four steps: [list steps]. Furthermore, each step operates independently.\"\n✅ \"The framework defines Y as Z. The system also includes error handling mechanisms.\"\n✅ \"Results show 95% accuracy. The method processes 1000 items per second.\"\n\nCONVERSION EXAMPLES:\n- \"Revolutionary deep learning architecture\" → \"Deep learning architecture\"\n- \"Groundbreaking research demonstrates\" → \"Research shows\" or \"Study finds\"\n- \"Brilliant approach reveals\" → \"Approach shows\" or \"Method indicates\"\n- \"Remarkable 95% accuracy\" → \"95% accuracy\"\n- \"Paradigm shift in design\" → \"New design approach\" or \"Design change\"\n\nTARGET LENGTH: comprehensive\nLANGUAGE: Spanish\n\nRemember: You are a technical manual writer, not a storyteller or analyst.\nPresent the content. Define the concepts. List the ideas. Nothing more.\n\n            ",
      "expected_output": "Technical presentation with zero interpretation - only facts and concepts as stated",
      "agent_role": "Technical Content Specialist"
    }
  ]
}