{
  "project_name": "managing_on_adhd",
  "paper_title": "Notes on Managing ADHD",
  "language": "Spanish",
  "agents": [
    {
      "role": "Coordinator",
      "goal": "Coordinate the discussion and ensure all perspectives are heard",
      "backstory": "You are an experienced moderator who ensures productive discussions"
    },
    {
      "role": "Scientific Reviewer",
      "goal": "Verify the soundness and methodology of the paper",
      "backstory": "You are a rigorous scientist who evaluates research methodology and conclusions"
    },
    {
      "role": "Critical Thinker",
      "goal": "Question assumptions and challenge ideas presented",
      "backstory": "You are a skeptical academic who questions everything and looks for flaws"
    },
    {
      "role": "Educational Writer",
      "goal": "Create engaging educational content in the style of popular science educators",
      "backstory": "You are a skilled science communicator who explains complex topics in an accessible, engaging way like 3Blue1Brown or other popular educators"
    },
    {
      "role": "Voice Director",
      "goal": "Transform content into perfect voice-ready script for publication",
      "backstory": "You are a master voice coach and script editor who specializes in creating flawless, publication-ready scripts that voice actors can read naturally. You ensure every word flows perfectly when spoken aloud."
    },
    {
      "role": "Medical Researcher",
      "goal": "Evaluate clinical methodology and medical evidence",
      "backstory": "You are a medical researcher with expertise in clinical trials and evidence-based medicine"
    },
    {
      "role": "Bioethicist",
      "goal": "Address ethical implications of medical research",
      "backstory": "You are a bioethicist concerned with patient welfare and research ethics"
    },
    {
      "role": "Clinician",
      "goal": "Provide practical medical perspective and real-world applications",
      "backstory": "You are a practicing physician who translates research into patient care"
    },
    {
      "role": "Patient Advocate",
      "goal": "Represent patient perspectives and concerns",
      "backstory": "You advocate for patient rights and understand how medical research affects real people"
    }
  ],
  "tasks": [
    {
      "description": "\n            Analyze the synthesis of the paper titled \"Notes on Managing ADHD\" and provide your perspective.\n            \n            Paper synthesis:\n            The paper “Notes on Managing ADHD” presents an integrative framework that blends biological understanding with structured external systems to overcome the everyday challenges of ADHD. At its core, the text asserts that effective ADHD management cannot rely on willpower or one-dimensional productivity hacks; instead, it requires both internal interventions—such as pharmacological treatments that re-establish chemical balance—and external scaffolds like todo lists, calendars, and even customized work environments that serve as extensions of one’s cognitive functions.\n\nThe narrative begins by framing the condition with both literary reflection and technical precision, using a Borges quotation to signal that managing ADHD is as much an art of rethinking internal dynamics as it is a science of re-engineering everyday practices. The author lays out the fundamental idea: before one can harness external productivity systems, one must attend to the underlying biological challenges. Drugs, particularly stimulants, are described not as an overplayed social prescription but as critical enablers. They recalibrate the brain's “voltage,” a metaphor which is introduced to contrast with the traditional spoon theory. Unlike spoons, which are fungible and simply countable, voltage represents a threshold-dependent energy that diminishes through the day—driving the scheduling of high-cognitive tasks early and low-cognitive tasks later. This analogy provides an “aha!” moment as it clearly explains why the timing of tasks becomes essential in overcoming procrastination and harnessing hyperfocus.\n\nBuilding on this foundation, the discussion deepens by dissecting techniques for managing both the initiation and cessation of tasks. The paper proposes a spectrum of strategies—from “do it scared” for anxious procrastination to systematic methods such as the Pomodoro technique. The Pomodoro technique is reconfigured for ADHD challenges: it frames a limited commitment (25–30 minutes) as a manageable block to overcome the inertia of starting, while also setting a hard stop to counter hyperfocus. Task selection becomes an art where the simplest or most procrastinated tasks are executed first, ensuring that momentum is built through “quick wins,” even as more complex projects are allowed to unfurl in smaller, iterative steps.\n\nThroughout the paper, external systems serve as cognitive neuroprostheses. The use of a highly detailed todo list, for example, goes beyond mere list-making—it compensates for deficits in working memory and prioritization. The author details his own system in Todoist, where different categories (Projects, Groceries, Ideas, etc.) are maintained to ensure that nothing falls through the cracks. This is tightly coupled with a hierarchical journaling system, encouraging frequent reflection to notice maladaptive patterns and to reinforce progress. Here, the interplay between planning and doing is highlighted: by separating the two, ADHD individuals can safeguard their mental resources against the unpredictable interference of distraction and hyperactivity.\n\nIn addressing procrastination, the paper distinguishes between:\n• ADHD procrastination (rooted in distraction/hyperactivity),\n• Anxious procrastination (where emotional aversion impedes task initiation), and\n• Decision paralysis procrastination (stemming from an overload of choices and uncertainty).\nEach type is met with tailored strategies; while ADHD procrastination is managed by both medication and clear scheduling, anxious procrastination calls for techniques like “doing it scared” or seeking support from someone present (an accountability buddy) to overcome immediate fear. For decision paralysis, the recommendation to externalize thoughts—by writing down arguments, bullet points, or even journaling extensively—provides a tangible anchor away from endless circling in one’s head.\n\nThe paper’s third and fourth sections extend these insights into the realm of detailed time management and organizational ergonomics. The concept of visual field management shows that by reducing clutter (both digital and physical), one can better focus on current and imminent tasks. The notion of “inbox zero” isn’t merely about clearing emails—it’s about eliminating ambiguity in one’s mental “to do” space. When every lingering message or reminder might hide an urgent task, a disciplined approach to achieving zero helps prevent the common pitfall of overlooked priorities. Coupled with concepts like “inbox bankruptcy” (archiving accumulated digital clutter for a fresh start), the text moves from theoretical discussion to actionable everyday strategies.\n\nAdditional practical advice is provided around managing interruptions: rather than letting notifications disrupt focus randomly, the author advocates for turning off disruptions and checking — or “polling”—communications in scheduled blocks. This technique minimizes distractions and mitigates the risk that important messages will be lost among nonessential ones. The recommendation to adapt aversive tasks to one’s own domain further illuminates the personalized nature of the strategies: for instance, converting a stressful government form into a spreadsheet transforms the experience, making the task feel less threatening and more within one’s own control.\n\nA notable layer of self-criticism rounds out the narrative. The wrap-up reflects on the limitations of conventional methods like the Getting Things Done (GTD) approach. While GTD’s insistence on “dumping your entire brain into the todo list” is valued for organization, it is critiqued for assuming a neurotypical ability to act on these tasks. This introspection powerfully reinforces the central message of the paper: conventional productivity advice must be tailored to address the unique execution barriers faced by individuals with ADHD.\n\nIn summary, “Notes on Managing ADHD” is a comprehensive blueprint that emphasizes:\n1. The essential interdependence between pharmacological treatment and structural productivity tools.\n2. The importance of re-conceptualizing mental energy (voltage) in daily scheduling to counteract procrastination.\n3. The need for a layered approach that distinguishes the types of procrastination and applies suitable strategies, whether it is breaking tasks into manageable micro-chunks or compartmentalizing complex projects through regular check-ins.\n4. Practical systems including digital tools (centralized todo lists, calendar scheduling, and hierarchical journaling) that serve as extensions of cognitive function.\n5. A healthy skepticism towards one-size-fits-all productivity approaches, advocating instead for methods that play to personal strengths and address the emotional as well as the cognitive dimensions of ADHD.\n\nBy fusing precise technical details with personal anecdotes and reflective insights, the paper does more than prescribe a list of actions—it crafts a holistic narrative that guides the reader through a dynamic process of self-optimization. The integration of internal pharmacological and psychological corrections with external methodical systems creates a sustainable path toward long-term personal growth and improved productivity. This multifaceted framework not only engages with the practical challenges of daily task management but also provides a conceptual shift: transforming the very understanding of ADHD from an insurmountable obstacle to a condition that, with the right combination of strategies, can be effectively managed and even leveraged into lasting improvement.\n            \n            CRITICAL: ONLY CONVERSATION AGENTS participate in this analysis:\n            - Base agents (Coordinator, Scientific Reviewer, Critical Thinker)\n            - Specialized domain agents\n            \n            EXCLUDED FROM ANALYSIS: Educational Writer, Voice Director, and Comedy Communicator (all work in post-production)\n            \n            Each participating agent should:\n            1. Read and understand the paper from your specific role's perspective\n            2. Identify key points relevant to your expertise\n            3. Prepare questions or concerns to discuss\n            4. Consider the implications from your unique viewpoint\n            \n            SPECIALIZED AGENTS: Pay special attention to domain-specific aspects that only you can address.\n            \n            This should be a comprehensive TECHNICAL analysis where EVERY conversation agent contributes their specialized perspective.\n            \n            Language: Spanish\n            ",
      "expected_output": "Comprehensive technical analysis from conversation agents only (no post-production agents)",
      "agent_role": "Coordinator"
    },
    {
      "description": "\n                    SPECIALIZED AGENTS DEEP DIVE: Domain expertise from TECHNICAL conversation agents only.\n                    \n                    PARTICIPATING SPECIALIZED AGENTS (technical focus):\n                    - Medical Researcher: Evaluate clinical methodology and medical evidence, - Bioethicist: Address ethical implications of medical research, - Clinician: Provide practical medical perspective and real-world applications, - Patient Advocate: Represent patient perspectives and concerns\n                    \n                    EXCLUDED: Comedy Communicator (works in post-production phase)\n                    \n                    Each specialized agent should:\n                    1. Provide deep domain-specific insights about the paper\n                    2. Identify methodological issues specific to your field\n                    3. Highlight implications that only someone with your expertise would notice\n                    4. Suggest domain-specific improvements or alternative approaches\n                    5. Connect this work to other research in your specialized area\n                    \n                    This is YOUR moment to shine with specialized knowledge that the base agents cannot provide.\n                    Focus on TECHNICAL DEPTH and DOMAIN EXPERTISE.\n                    Format as a detailed specialist consultation with clear attribution to each expert.\n                    \n                    Language: Spanish\n                    ",
      "expected_output": "Deep technical specialist analysis from 4 domain experts",
      "agent_role": "Medical Researcher"
    },
    {
      "description": "\n            Based on the initial analysis, conduct a DYNAMIC Q&A session where technical conversation agents ask each other specific questions about the paper synthesis.\n            \n            PARTICIPATING AGENTS (technical conversation only):\n            - Base conversation agents (Coordinator, Scientific Reviewer, Critical Thinker) \n            - ALL specialized domain agents\n            \n            EXCLUDED FROM CONVERSATION: Educational Writer, Voice Director, and Comedy Communicator (all work in post-production)\n            \n            Instructions for multi-agent technical conversation:\n            1. ALL TECHNICAL CONVERSATION AGENTS should ask pointed questions to other agents\n            2. SPECIALIZED AGENTS should ask domain-specific questions that challenge assumptions\n            3. BASE AGENTS should ask specialists to clarify complex domain concepts\n            4. Agents must respond to questions directed at them with detailed technical answers\n            5. Follow-up questions and clarifications are encouraged\n            6. Challenge each other's assumptions respectfully\n            7. Build on each other's ideas and insights\n            8. Create a natural back-and-forth technical dialogue\n            \n            SPECIALIZED AGENTS: This is crucial - ask questions only YOU would think to ask!\n            \n            Focus areas for technical questions:\n            - Domain-specific methodological concerns\n            - Interdisciplinary connections and conflicts\n            - Alternative interpretations from different expert perspectives\n            - Practical applications in each specialist's field\n            - Potential limitations or biases from multiple viewpoints\n            \n            Format this as a realistic TECHNICAL conversation with clear speaker identification for ALL conversation participants.\n            Keep the tone SERIOUS and TECHNICAL - humor will be added later in post-production.\n            \n            Language: Spanish\n            ",
      "expected_output": "Dynamic technical Q&A conversation between conversation agents only (no post-production or humor)",
      "agent_role": "Critical Thinker"
    },
    {
      "description": "\n            Organize a structured technical debate where conversation agents with different viewpoints engage in deeper discussion.\n            \n            PARTICIPATING AGENTS (technical conversation only):\n            - Base conversation agents (Coordinator, Scientific Reviewer, Critical Thinker)\n            - ALL specialized domain agents  \n            \n            EXCLUDED FROM DEBATE: Educational Writer, Voice Director, and Comedy Communicator (all work in post-production)\n            \n            Technical debate structure:\n            1. Present the main controversial points or interpretations from the paper\n            2. Have TECHNICAL CONVERSATION AGENTS take different positions and argue their cases\n            3. SPECIALIZED AGENTS: Argue from your domain expertise - what would your field say?\n            4. Allow for rebuttals and counter-arguments between different expert perspectives\n            5. Explore edge cases and hypothetical scenarios from multiple disciplinary angles\n            6. Find areas of agreement and persistent disagreements between different specialties\n            7. Synthesize different viewpoints into a richer technical understanding\n            \n            This should feel like a real interdisciplinary TECHNICAL conference where:\n            - Different specialists bring unique perspectives that sometimes conflict\n            - Domain experts interrupt each other (politely) to make field-specific points\n            - Ideas evolve through interaction between different areas of expertise\n            - New insights emerge from cross-disciplinary exchange\n            - There's intellectual tension between different specialist viewpoints\n            \n            SPECIALIZED AGENTS: Don't hold back - defend your field's perspective!\n            \n            Make it conversational and dynamic, but keep TECHNICAL FOCUS - humor will be added later.\n            \n            Language: Spanish\n            ",
      "expected_output": "Rich interdisciplinary technical debate between conversation agents only (no post-production or humor)",
      "agent_role": "Scientific Reviewer"
    },
    {
      "description": "\n            Conduct a collaborative synthesis where technical conversation agents work together to build a comprehensive understanding.\n            \n            PARTICIPATING AGENTS (technical conversation only):\n            - Base conversation agents (Coordinator, Scientific Reviewer, Critical Thinker)\n            - ALL specialized domain agents\n            \n            EXCLUDED FROM SYNTHESIS: Educational Writer, Voice Director, and Comedy Communicator (all work in post-production)\n            \n            Technical collaborative process:\n            1. ALL TECHNICAL CONVERSATION AGENTS contribute their key insights from the discussions\n            2. SPECIALIZED AGENTS highlight unique perspectives only your field can provide\n            3. Agents build on each other's contributions in real-time\n            4. Identify connections between different specialist perspectives\n            5. Resolve conflicting interpretations through interdisciplinary dialogue\n            6. Co-create new insights that emerge from cross-domain discussion\n            7. Establish consensus on the most important takeaways from ALL conversation perspectives\n            \n            This should be a generative TECHNICAL conversation where:\n            - Ideas from one specialist spark new ideas in other specialists\n            - The group intelligence exceeds individual specialist perspectives\n            - Agents actively listen and respond to insights from other domains\n            - The conversation flows naturally between different areas of expertise\n            - New understanding emerges from interdisciplinary interaction\n            - Each specialist's unique knowledge contributes to the whole\n            \n            SPECIALIZED AGENTS: Share insights that ONLY someone with your expertise would have!\n            \n            Format as natural TECHNICAL conversation with organic transitions between specialist viewpoints.\n            Keep SERIOUS and FOCUSED - entertainment will be added later in post-production.\n            \n            Language: Spanish\n            ",
      "expected_output": "Collaborative technical synthesis conversation from conversation agents only (no post-production or humor)",
      "agent_role": "Coordinator"
    },
    {
      "description": "\n            Based on all previous conversations and analyses, conduct a final comprehensive technical discussion that synthesizes insights from conversation agents.\n            \n            PARTICIPATING AGENTS (technical conversation only):\n            - Base conversation agents (Coordinator, Scientific Reviewer, Critical Thinker)\n            - ALL specialized domain agents\n            \n            EXCLUDED: Educational Writer, Voice Director, and Comedy Communicator (they will process this output in post-production)\n            \n            The final technical discussion should:\n            1. Synthesize insights from the Q&A, specialist deep dive, debate, and collaborative sessions\n            2. Cover all major points of the paper from multiple expert perspectives\n            3. Include the rich specialist perspectives developed through agent interactions\n            4. Address concerns and criticisms that emerged from different domains\n            5. Explore implications and applications discussed by various specialists\n            6. Be comprehensive and technically rigorous for expert audiences\n            7. Highlight unique insights that could ONLY come from having multiple specialist perspectives\n            \n            CRITICAL: This final technical discussion must incorporate:\n            - Domain-specific insights from ALL specialist conversation agents\n            - Cross-disciplinary connections discovered during discussions\n            - Unique perspectives that emerged from interdisciplinary dialogue\n            - Technical depth and rigor appropriate for expert audiences\n            \n            This is the FINAL technical conversation output that will be handed to the post-production team.\n            Make it comprehensive, rigorous, and rich with all the insights gathered.\n            Keep it TECHNICAL and SERIOUS - post-production will handle accessibility and entertainment.\n            \n            Language: Spanish\n            ",
      "expected_output": "Final comprehensive technical discussion ready for post-production processing",
      "agent_role": "Critical Thinker"
    },
    {
      "description": "\n            POST-PRODUCTION PHASE 2: EDUCATIONAL SCRIPT CREATION\n            \n            Transform ALL the rich content into a comprehensive educational lecture text.\n            \n            DOCUMENT TITLE: Notes on Managing ADHD\n            \n            You are receiving the complete output, which includes:\n            - Initial analysis from all conversation agents\n            - Specialized domain expert deep dive\n            - Dynamic Q&A sessions between experts\n            - Interdisciplinary technical debates\n            - Collaborative synthesis\n            - Final comprehensive technical discussion\n            \n            \n            Your job is to distill ALL this rich content into a single educator voice.\n            \n            The script should be in the style of popular science educators like 3Blue1Brown:\n            1. Written as a SINGLE EDUCATOR speaking directly to the listener (use \"tú\"/\"usted\")\n            2. CRITICAL INTRODUCTION STRUCTURE:\n               a) START with a HOOK - a question, surprising fact, or intriguing statement (NOT \"En resumen...\")\n               b) THEN naturally introduce the topic: \"Notes on Managing ADHD\" after engaging the listener\n               c) Examples of good hooks: \"¿Alguna vez te has preguntado...?\", \"Imagina por un momento...\", \"Hay algo sorprendente sobre...\"\n               d) NEVER start with: \"En resumen\", \"Hoy vamos a hablar de\", \"Este es un resumen de\"\n            3. Use analogies and accessible explanations\n            4. Include ALL key insights from the multiple conversations and specialist exchanges\n            5. Be engaging and educational, not just informative\n            6. Flow naturally from concept to concept with smooth transitions\n            7. Include moments of wonder and intellectual curiosity\n            8. Break down complex ideas into digestible parts\n            9. Use a teaching tone that makes the listener feel they're learning something fascinating\n            10. Write as continuous text ready to be read by a voice actor\n            11. NO section headers, NO subheaders, NO formatting marks\n            12. Don't address the public with greetings or goodbyes, but make questions\n            13. Always end up with questions for the reader and practical implications\n            14. Write as plain text that flows naturally for voice reading\n            15. NO [PAUSES], NO [MUSIC], NO stage directions - just the educational content\n            16. CRITICAL: Address the listener directly - \"puedes imaginar\", \"si consideras\", \"te darás cuenta\"\n            17. DO NOT write as if summarizing a discussion - write as if YOU are the teacher\n            18. Avoid phrases like \"los expertos discutieron\" or \"el equipo concluyó\"\n            19. Incorporate the depth and nuance that emerged from ALL agent conversations\n            \n            CRITICAL DIDACTIC TECHNIQUES - MANDATORY:\n            20. INTRODUCTION must include a compelling preview/roadmap: After the hook and title mention, preview what the listener will learn - \"En los próximos minutos vas a descubrir...\", \"Te voy a mostrar tres ideas que cambiarán tu forma de pensar sobre...\", etc.\n            21. CONCLUSION must include a clear summary: End with a recap of the main points covered - \"Hemos visto que...\", \"Los tres puntos clave que exploramos fueron...\", \"Para cerrar, recordemos que...\", etc. (\"En resumen\" is ONLY acceptable here in conclusions)\n            22. AVOID TYPICAL LLM WORDS: Never use overused AI-generated words like \"fundamental\", \"crucial\", \"clave\" (as adjective), \"esencial\", \"revelador\", \"fascinante\", \"delve into\", \"explore\", \"unpack\", \"dive deep\", \"robust\", \"compelling\", etc.\n            23. USE NATURAL LANGUAGE: Instead of LLM words, use conversational alternatives like \"importante\", \"interesante\", \"sorprendente\", \"nos ayuda a entender\", \"vamos a ver\", \"resulta que\", \"descubrimos que\", etc.\n            24. SOUND HUMAN: Write as if explaining to a friend over coffee, not as if generating academic content\n            \n            CRITICAL - MULTI-SPECIALIST INTEGRATION:\n            19. Weave in insights that could ONLY come from having multiple specialist perspectives\n            20. Include cross-disciplinary connections discovered during discussions\n            21. Incorporate domain-specific knowledge from ALL participating specialists\n            22. Show how different expert viewpoints enhance understanding of the topic\n            \n            23. Demonstrate the value of interdisciplinary analysis throughout\n            \n            \n            ACCESSIBLE LEVEL REQUIREMENTS:\n            15. Focus on core concepts and main findings rather than technical details\n            16. Use everyday analogies to explain complex ideas\n            17. Emphasize practical implications and real-world applications\n            18. Keep technical jargon to a minimum, always explaining when used\n            19. Focus on the \"why this matters\" rather than the \"how they did it\"\n            20. Make connections to things the audience already understands\n            \n            \n            \n        DURATION REQUIREMENT: EXACTLY 10 minutes of content (1400-1600 words) - THIS IS MANDATORY\n        \n        DEPTH GUIDANCE FOR 10 MINUTES:\n        \n            - Address 4-6 main concepts with moderate depth\n            - Include multiple examples and analogies per concept\n            - Provide relevant historical and theoretical context\n            - Explore implications and practical applications\n            - Include brief discussion of methodology if relevant\n            \n        \n        TECHNICAL CALCULATION:\n        - Target reading speed: ~150 words per minute\n        - Word range: 1400-1600 words\n        - If content is too short, EXPAND significantly with more detail and depth\n        - If too long, maintain quality but adjust information density\n        \n            \n            \n            LANGUAGE REQUIREMENTS FOR SPANISH:\n            \n            CRITICAL: AVOID ANGLICISMS whenever possible and use proper Spanish terms:\n            - Instead of \"link\" use \"enlace\" or \"vínculo\"\n            - Instead of \"feedback\" use \"retroalimentación\" or \"respuesta\"\n            - Insted of \"puzzle\" use \"rompecabezas\" or \"problema\"\n            - Instead of \"performance\" use \"rendimiento\" or \"desempeño\"\n            - Instead of \"input/output\" use \"entrada/salida\"\n            - Instead of \"update\" use \"actualizar\" or \"poner al día\"\n            \n            EXCEPTIONS - You CAN use anglicisms for:\n            1. Very new technical terms with no established translation (e.g., \"blockchain\", \"ChatGPT\")\n            2. Proper names of tools/companies (e.g., \"TensorFlow\", \"GitHub\", \"OpenAI\")\n            3. Widely adopted terms in scientific literature (e.g., \"machine learning\" vs \"aprendizaje automático\")\n            4. When the Spanish term is more confusing than helpful\n            \n            GENERAL RULES:\n            - Always prioritize natural Spanish expressions\n            - Use Spanish sentence structures and idioms\n            - Make it sound like a native Spanish speaker wrote it\n            - When you must use an anglicism, briefly explain it if needed\n            \n            \n            Language: Spanish\n            ",
      "expected_output": "Comprehensive educational script incorporating ALL conversation insights",
      "agent_role": "Educational Writer"
    },
    {
      "description": "\n            POST-PRODUCTION PHASE 3: FINAL VOICE OPTIMIZATION\n            \n            Transform the Educational Writer's script into a PERFECT voice-ready script.\n            \n            You are receiving the educational script that has been carefully crafted from all conversation insights\n            .\n            Your job is PURELY technical optimization for voice delivery.\n            \n            CRITICAL: Verify the content meets the 10-minute target (1400-1600 words). If it's too short, EXPAND it significantly.\n            CRITICAL: Ensure technical level is accessible - keep accessible but thorough.\n            \n            MANDATORY VOICE OPTIMIZATION REQUIREMENTS:\n            1. Create a SINGLE, CONTINUOUS text ready for a voice actor to read\n            2. Markdown formatting, but NO headers, NO bullet points, NO lists\n            3. Convert ALL content into natural, flowing sentences\n            4. Replace any remaining bullet points with complete sentences\n            5. Ensure PERFECT flow from sentence to sentence\n            6. Remove formatting marks: #, -, •, etc for titles and subtitles, but keep for bold and italic text\n            7. Make sure sentences are not too long or complex for voice delivery\n            8. Write naturally in Spanish without academic formalities\n            9. Remove any remaining conversational artifacts (\"como mencionamos antes\", \"en nuestra discusión\")\n            10. Ensure seamless transitions between concepts\n            11. Maintain the conversational richness but in a single educator voice\n            12. Read the text mentally to ensure it sounds natural when spoken\n            13. Ensure proper pronunciation flow for difficult technical terms\n            14. Remove any repetitive content that may have emerged from multiple discussions\n            15. Maintain the depth gained from agent conversations while ensuring clarity\n            16. Perfect pacing for natural speech rhythm\n            17. Eliminate any phrases that sound like committee work or group consensus\n            18. Make it sound like ONE expert who has deeply understood the topic\n            19. Ensure technical accuracy while maintaining conversational flow\n            20. Optimize for voice actor performance and listener engagement\n            21. This should sound like ONE VOICE teaching, not a summary of multiple voices\n            22. Avoid words that could make this sound like written by an LLM, like not often used words: \"fascinante\", \"delve\", \"revelador\"\n            23. CRITICAL INTRODUCTION VERIFICATION:\n                a) MUST start with a catchy hook (question, surprising fact, intriguing statement)\n                b) NEVER start with \"En resumen\", \"Hoy vamos a hablar de\", \"Este es un resumen de\"\n                c) The title/topic should be mentioned AFTER the hook, integrated naturally\n                d) If the script starts with \"En resumen\" or similar, REWRITE the entire introduction\n            24. DO NOT add new content - only optimize existing content for voice delivery\n            25. DO NOT change the educational message - only improve its delivery\n            \n            CRITICAL DIDACTIC STRUCTURE VERIFICATION:\n            26. VERIFY INTRODUCTION includes preview/roadmap: Ensure there's a clear \"what you'll learn\" section early in the script (AFTER the hook and title mention)\n            27. VERIFY CONCLUSION includes summary: Ensure there's a clear recap of main points at the end (\"En resumen\" is ONLY acceptable in conclusions)\n            28. REMOVE LLM WORDS: Replace any remaining \"fundamental\", \"crucial\", \"clave\" (adjective), \"esencial\", \"revelador\", \"fascinante\", \"compelling\", \"robust\", etc. with natural alternatives\n            29. HUMAN CONVERSATION: Ensure the entire script sounds like a knowledgeable person explaining something interesting, not AI-generated content\n            30. NATURAL FLOW: Check that didactic elements (preview, summary) flow naturally within the content, not as forced additions\n            31. HOOK QUALITY CHECK: The opening sentence should immediately grab attention - if it doesn't, rewrite it\n            \n\n            \n            LANGUAGE REQUIREMENTS FOR SPANISH:\n            \n            CRITICAL: AVOID ANGLICISMS whenever possible and use proper Spanish terms:\n            - Instead of \"link\" use \"enlace\" or \"vínculo\"\n            - Instead of \"feedback\" use \"retroalimentación\" or \"respuesta\"\n            - Insted of \"puzzle\" use \"rompecabezas\" or \"problema\"\n            - Instead of \"performance\" use \"rendimiento\" or \"desempeño\"\n            - Instead of \"input/output\" use \"entrada/salida\"\n            - Instead of \"update\" use \"actualizar\" or \"poner al día\"\n            \n            EXCEPTIONS - You CAN use anglicisms for:\n            1. Very new technical terms with no established translation (e.g., \"blockchain\", \"ChatGPT\")\n            2. Proper names of tools/companies (e.g., \"TensorFlow\", \"GitHub\", \"OpenAI\")\n            3. Widely adopted terms in scientific literature (e.g., \"machine learning\" vs \"aprendizaje automático\")\n            4. When the Spanish term is more confusing than helpful\n            \n            GENERAL RULES:\n            - Always prioritize natural Spanish expressions\n            - Use Spanish sentence structures and idioms\n            - Make it sound like a native Spanish speaker wrote it\n            - When you must use an anglicism, briefly explain it if needed\n            \n            \n            CRITICAL: This is the FINAL version that will be published. Make it PERFECT for voice delivery.\n            \n            Language: Spanish\n            ",
      "expected_output": "FINAL publication-ready voice script optimized for delivery (1400-1600 words)",
      "agent_role": "Voice Director"
    }
  ]
}