{
  "project_name": "team_effort",
  "paper_title": "Choosing where to spend my team’s effort",
  "language": "Spanish",
  "agents": [
    {
      "role": "Coordinator",
      "goal": "Coordinate the discussion and ensure all perspectives are heard",
      "backstory": "You are an experienced moderator who ensures productive discussions"
    },
    {
      "role": "Scientific Reviewer",
      "goal": "Verify the soundness and methodology of the paper",
      "backstory": "You are a rigorous scientist who evaluates research methodology and conclusions"
    },
    {
      "role": "Critical Thinker",
      "goal": "Question assumptions and challenge ideas presented",
      "backstory": "You are a skeptical academic who questions everything and looks for flaws"
    },
    {
      "role": "Educational Writer",
      "goal": "Create engaging educational content in the style of popular science educators",
      "backstory": "You are a skilled science communicator who explains complex topics in an accessible, engaging way like 3Blue1Brown or other popular educators"
    },
    {
      "role": "Voice Director",
      "goal": "Transform content into perfect voice-ready script for publication",
      "backstory": "You are a master voice coach and script editor who specializes in creating flawless, publication-ready scripts that voice actors can read naturally. You ensure every word flows perfectly when spoken aloud."
    }
  ],
  "tasks": [
    {
      "description": "\n            Analyze the paper titled \"Choosing where to spend my team’s effort\" and provide your perspective.\n            \n            Paper content:\n            It s the start of a new fiscal year. Strategy season. That time when all the grand ideas come out and everyone is still hopefull.\nOver the years, I ve settled into a structure that helps me define projects that not only link to the strategy above but also looks at my own team s enviroment, I thought I d share it here.\nStrategy usually comes down from the top. The C-suite sketches the big picture, department heads slice it into projects, and those trickle down to the teams. It s not always a very transparent process, but that s how it works.\nKnowing this, there are some ways you can take (partly) ownership of this process by injecting your own projects into it. We ve talked a lot on this site about organizational layers so there might be some projects that you can think of that benefit the strategy that layers above you might not see. What you see depends on where you sit. That means there might be gaps in vision, gaps that you can fill.\nFirst things first is getting to know the strategy. That sounds extremely obvious, but it s something, so many team leads skip over. Having a conversation with your boss about where the company wants to go towards in the next X years and where your boss s boss wants to go, and why. The bigger picture stuff. If you ve never done that, you d be surprised how suddenly some questionable decisions from the past suddenly make a lot more sense. This is something I would do at least yearly.\nAll the work will be routed in this. If you can pitch your projects in the framework of the company s strategy your odds of a successful pitch will skyrocket, most of the convincing has been done for you already. Not only that, your boss can easily pitch that project to the higher ups. Everyone wins.\nOk, you ve got the strategy. Now how do you turn that into projects? I like to use a bastardization of Teresa Torres s opportunity solution tree. It s a startup thing, but it works just fine in the grand halls of enterprise.\nI use it like this:\nYou take one of the strategies. An example would be: we want to reduce cost. The next step is to start linking broad actions that we could take to handle that strategy. EG: automate processes, eliminate underused software, look at licences. Don t judge the ideas too much yet, this is the part where you make the mess.\nYou can do of these things alone, but it s probably better to get some smart people in the room from your team. Again, you only know what you know. More brains, more angles.\nOnce we have these vague ideas, it s time to shift from vague to specific. It s possible that you can t find a real project for an item in the tree above, or that if you go deeper into it, it turns out that it was not a great idea. This is good, that means that you are already filtering out the fluff.\nThe last step is thinking of a proof of concept, this is another filter layer. What can we quickly build that proves this idea has legs? If you can t find something that can at least proof rather quickly if there is value or not, it s probably not something to pursue. This process turns abstract strategy into stuff that ships and also gives you the ammunition to pitch it, as you walked the logic all the way down.\nYou might end up with something like this:\nThis is good, but it can be better\nYou could stop here and have a solid list of projects. Your boss would be impressed. But I think the real kicker would be to have projects that serve more than one strategy.\nAt the vague idea stage, before turning anything into a project, pause. Run the same exercise for your other strategies. Build separate trees. Then take a step back. Look across them. You ll start to see overlap, ideas that touch multiple goals at once. Those are the winners. The projects that move more than one needle. The ones that get budget and visibility.\nThis is where the real value starts showing up.\nOnce you start defining projects, focus on the ones that serve multiple strategies at once. For example:\nSay the sales team manually emails orders to the delivery team. You could replace that with an API connection. That alone cuts labor costs. But there s a second win: if you re also planning Project X, and it needs real-time order data, that API suddenly becomes critical infrastructure. One move, two wins.\nSo now your project becomes: Build an API that connects sales and delivery across product platforms.\nAnd when you kick off Project X, you re already set up to automate and move faster. You didn t just deliver a feature. You moved strategy forward on two fronts.\nMost teams don t. But this is a first step towards something like that. What we are doing here is helping your boss look good to their boss. We reach out and help find answers to the questions they get asked.\nThe first time you try, you might get brushed off, plans are already locked in, no time for new ideas. That s fine. The second time the strategy to project planning comes around, you have a higher chance to be in the room where it happens, as you ve proven in the past that you understand how these things work.\nAnd yes, your team is probably already busy. Everyone is. It is important to remember that you re reaching out with potential projects that we can do, ideally replacing assigned work with chosen work, not taking on the extra projects. Suggesting projects doesn t mean you re committing to them: it means you re helping to shape the conversation.\nReplace assigned work with chosen work. That s the shift.\n            \n            Each agent should:\n            1. Read and understand the paper from your role's perspective\n            2. Identify key points relevant to your expertise\n            3. Prepare questions or concerns to discuss\n            4. Consider the implications from your viewpoint\n            \n            Language: Spanish\n            ",
      "expected_output": "Initial analysis and key points from each role's perspective",
      "agent_role": "Coordinator"
    },
    {
      "description": "\n            Based on the initial analysis, conduct a thorough discussion of the paper.\n            \n            The discussion should:\n            1. Cover all major points of the paper\n            2. Include different perspectives from each role\n            3. Address potential concerns and criticisms\n            4. Explore implications and applications\n            5. Be engaging and conversational\n            \n            Create a rich dialogue that would be interesting for a podcast audience.\n            Language: Spanish\n            ",
      "expected_output": "Comprehensive discussion transcript with multiple perspectives",
      "agent_role": "Critical Thinker"
    },
    {
      "description": "\n            Transform the discussion into a relaxed educational lecture text.\n            \n            The script should be in the style of popular science educators like 3Blue1Brown:\n            1. Written as a SINGLE EDUCATOR speaking directly to the listener (use \"tú\"/\"usted\")\n            2. Use analogies and accessible explanations\n            3. Include all key insights from the discussion\n            4. Be engaging and educational, not just informative\n            5. Flow naturally from concept to concept with smooth transitions\n            6. Include moments of wonder and intellectual curiosity\n            7. Break down complex ideas into digestible parts\n            8. Use a teaching tone that makes the listener feel they're learning something fascinating\n            9. Write as continuous text ready to be read by a voice actor\n            10. NO section headers, NO subheaders, NO formatting marks\n            11. Don't address the public with greetings or goodbyes, but make questions\n            12. Always end up with questions for the reader and practical implications\n            13. Write as plain text that flows naturally for voice reading\n            14. NO [PAUSES], NO [MUSIC], NO stage directions - just the educational content\n            15. CRITICAL: Address the listener directly - \"puedes imaginar\", \"si consideras\", \"te darás cuenta\"\n            16. DO NOT write as if summarizing a discussion - write as if YOU are the teacher\n            17. Avoid phrases like \"los expertos discutieron\" or \"el equipo concluyó\"\n            \n            \n            ACCESSIBLE LEVEL REQUIREMENTS:\n            15. Focus on core concepts and main findings rather than technical details\n            16. Use everyday analogies to explain complex ideas\n            17. Emphasize practical implications and real-world applications\n            18. Keep technical jargon to a minimum, always explaining when used\n            19. Focus on the \"why this matters\" rather than the \"how they did it\"\n            20. Make connections to things the audience already understands\n            \n            \n            \n        DURATION REQUIREMENT: EXACTLY 4 minutes of content (560-640 words) - THIS IS MANDATORY\n        \n        DEPTH GUIDANCE FOR 4 MINUTES:\n        \n            - Cover 2-4 key concepts with moderate explanations\n            - Include detailed examples and clear analogies\n            - Provide necessary basic context\n            - Allow some exploration of implications\n            \n        \n        TECHNICAL CALCULATION:\n        - Target reading speed: ~150 words per minute\n        - Word range: 560-640 words\n        - If content is too short, EXPAND significantly with more detail and depth\n        - If too long, maintain quality but adjust information density\n        \n            \n            \n            LANGUAGE REQUIREMENTS FOR SPANISH:\n            \n            CRITICAL: AVOID ANGLICISMS whenever possible and use proper Spanish terms:\n            - Instead of \"link\" use \"enlace\" or \"vínculo\"\n            - Instead of \"feedback\" use \"retroalimentación\" or \"respuesta\"\n            - Insted of \"puzzle\" use \"rompecabezas\" or \"problema\"\n            - Instead of \"performance\" use \"rendimiento\" or \"desempeño\"\n            - Instead of \"input/output\" use \"entrada/salida\"\n            - Instead of \"update\" use \"actualizar\" or \"poner al día\"\n            \n            EXCEPTIONS - You CAN use anglicisms for:\n            1. Very new technical terms with no established translation (e.g., \"blockchain\", \"ChatGPT\")\n            2. Proper names of tools/companies (e.g., \"TensorFlow\", \"GitHub\", \"OpenAI\")\n            3. Widely adopted terms in scientific literature (e.g., \"machine learning\" vs \"aprendizaje automático\")\n            4. When the Spanish term is more confusing than helpful\n            \n            GENERAL RULES:\n            - Always prioritize natural Spanish expressions\n            - Use Spanish sentence structures and idioms\n            - Make it sound like a native Spanish speaker wrote it\n            - When you must use an anglicism, briefly explain it if needed\n            \n            \n            Language: Spanish\n            ",
      "expected_output": "Clean educational text ready for voice actor reading",
      "agent_role": "Educational Writer"
    },
    {
      "description": "\n            FINAL STEP: Transform the educational content into a PERFECT voice-ready script.\n            \n            CRITICAL: Verify the content meets the 4-minute target (560-640 words). If it's too short, EXPAND it significantly.\n            CRITICAL: Ensure technical level is accessible - keep accessible but thorough.\n            \n            MANDATORY VOICE OPTIMIZATION REQUIREMENTS:\n            1. Create a SINGLE, CONTINUOUS text ready for a voice actor to read\n            2. Markdown formatting, but NO headers, NO bullet points, NO lists\n            3. Convert ALL content into natural, flowing sentences\n            4. Replace any remaining bullet points with complete sentences\n            5. Ensure PERFECT flow from sentence to sentence\n            6. Remove formatting marks: #, -, •, etc for titles and subtitles, but keep for bold and italic text\n            7. Make sure sentences are not too long or complex for voice delivery\n            8. Use natural speech patterns and rhythm\n            9. Include natural transitions between concepts (\"Ahora consideremos...\", \"Lo que resulta particularmente interesante es...\")\n            10. NO stage directions, NO [PAUSES], NO [MUSIC], NO technical annotations\n            11. NO greetings or goodbyes - start directly with content\n            12. End with thought-provoking questions and practical implications\n            13. If content is too short, SIGNIFICANTLY EXPAND with more detail and depth\n            14. This must be PUBLICATION-READY text that a voice actor can read smoothly\n            15. Every word should sound natural when spoken aloud\n            16. CRITICAL: When writing in second person, use second person relaxed pronouns, like \"tú\" in spanish, for the listener, but use it naturally\n            17. DO NOT refer to \"we researchers\", \"our discussion\", \"the team analyzed\" - this is NOT a research report\n            18. Instead use: \"si consideras\", \"puedes ver que\", \"imagina que\", \"te preguntarás\", etc.\n            19. Write as if a SINGLE EDUCATOR is teaching directly to the listener\n            20. Remove any references to \"coordinators\", \"discussions between experts\", or \"our analysis\"\n            21. This should sound like ONE VOICE teaching, not a summary of multiple voices\n            22. Avoid words that could make this sound like written by an LLM, like not often used words: \"fascinante\", \"delve\",\n            \"revelador\".\n            23. Introduction should be a catchy hook that makes the listener want to listen to the entire video, something like a question or a statement that makes the listener want to know more.\n\n            \n            LANGUAGE REQUIREMENTS FOR SPANISH:\n            \n            CRITICAL: AVOID ANGLICISMS whenever possible and use proper Spanish terms:\n            - Instead of \"link\" use \"enlace\" or \"vínculo\"\n            - Instead of \"feedback\" use \"retroalimentación\" or \"respuesta\"\n            - Insted of \"puzzle\" use \"rompecabezas\" or \"problema\"\n            - Instead of \"performance\" use \"rendimiento\" or \"desempeño\"\n            - Instead of \"input/output\" use \"entrada/salida\"\n            - Instead of \"update\" use \"actualizar\" or \"poner al día\"\n            \n            EXCEPTIONS - You CAN use anglicisms for:\n            1. Very new technical terms with no established translation (e.g., \"blockchain\", \"ChatGPT\")\n            2. Proper names of tools/companies (e.g., \"TensorFlow\", \"GitHub\", \"OpenAI\")\n            3. Widely adopted terms in scientific literature (e.g., \"machine learning\" vs \"aprendizaje automático\")\n            4. When the Spanish term is more confusing than helpful\n            \n            GENERAL RULES:\n            - Always prioritize natural Spanish expressions\n            - Use Spanish sentence structures and idioms\n            - Make it sound like a native Spanish speaker wrote it\n            - When you must use an anglicism, briefly explain it if needed\n            \n            \n            CRITICAL: This is the FINAL version that will be published. Make it PERFECT.\n            \n            Language: Spanish\n            ",
      "expected_output": "FINAL publication-ready voice script (560-640 words)",
      "agent_role": "Voice Director"
    }
  ]
}